app/controllers/course_plans_controller.rb

INSERT INTO "course_plans" ("student_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["student_id", 2], ["created_at", "2015-03-31 01:11:34.146437"], ["updated_at", "2015-03-31 01:11:34.146437"]]
---
  def create
    @course_plan = CoursePlan.new(plan_params)
    if @course_plan.save

SELECT  "course_plans".* FROM "course_plans" WHERE "course_plans"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @course_plan = CoursePlan.find(params[:id])