app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "subject", "call_number", "credit_hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Computer Science 1"], ["subject", "CS"], ["call_number", 1050], ["credit_hours", 4], ["created_at", "2015-03-29 17:33:50.157458"], ["updated_at", "2015-03-29 17:33:50.157458"]]
---
  def create
    @course = Course.new(course_params)
    if @course.save