app/controllers/years_controller.rb

  def create
    @course_plan = CoursePlan.find(params[:course_plan_id])
    @year = @course_plan.years.new(year_params)
    @year.save
---
SELECT  "course_plans".* FROM "course_plans" WHERE "course_plans"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "years" ("course_plan_id", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_plan_id", 1], ["year", 2017], ["created_at", "2015-03-31 01:11:34.409836"], ["updated_at", "2015-03-31 01:11:34.409836"]]